Revit 2027 API
HostObjectSubcomponentInfo.GetPlane Method
 Gets the plane representing the normal and origin of the surface containg the base profile curve loop of the roof or floor slab.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Plane GetPlane()
Public Function GetPlane As Plane
public:
Plane^ GetPlane()
member GetPlane : unit -> Plane
Return Value
Plane
 The plane.
See Also
Reference
HostObjectSubcomponentInfo Class
Autodesk.Revit.DB.IFC Namespace